final quizList = [
  {
    'question': '千種高校の校章に使われている花は？',
    'options': ['桜', '梅', '椿', '千種草'],
    'answer': 2,
  },
  {
    'question': '今年の学校祭テーマは？',
    'options': ['奇跡', '革新', 'つながり', '笑顔'],
    'answer': 0,
  },
  {
    'question': '生徒玄関の壁の色は？',
    'options': ['白', 'ベージュ', 'グレー', '水色'],
    'answer': 1,
  },
  {
    'question': '購買の一番人気メニューは？',
    'options': ['からあげ棒', '焼きそばパン', 'チョコドーナツ', 'メロンパン'],
    'answer': 0,
  },
  {
    'question': '学校祭の最終イベントは？',
    'options': ['閉会式', '後夜祭', 'ステージ発表', 'フォトセッション'],
    'answer': 1,
  },
];


